In [4]:
import pandas as pd
import numpy as np
data=pd.DataFrame({"name":['Ani','Anu','Anee'],
                  "id":[332,282,np.nan]})
data

   name     id
0   Ani  332.0
1   Anu  282.0
2  Anee    NaN

In [5]:
data.fillna('120')

   name     id
0   Ani  332.0
1   Anu  282.0
2  Anee    120

In [10]:
data=pd.DataFrame({"name":['Ani',np.nan,'anee'],
                  "id":[332,282,np.nan]})
data

   name     id
0   Ani  332.0
1   NaN  282.0
2  anee    NaN

In [11]:
data.fillna('exo')

   name     id
0   Ani  332.0
1   exo  282.0
2  anee    exo

In [12]:
data.dropna()

  name     id
0  Ani  332.0

In [13]:
data

   name     id
0   Ani  332.0
1   NaN  282.0
2  anee    NaN

In [14]:
data.dropna(axis=0)

  name     id
0  Ani  332.0

In [17]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [18]:
data["name"].fillna('dsd')

0     Ani
1     dsd
2    anee
Name: name, dtype: object

In [19]:
data.replace(np.nan,'Anu')

   name     id
0   Ani  332.0
1   Anu  282.0
2  anee    Anu

In [21]:
data=pd.DataFrame({"Name":['A','B','C',np.nan,np.nan,np.nan],
                  "ID":[332,252,np.nan,167,np.nan,np.nan],
                  "Adress":[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]
                  })
data

  Name     ID  Adress
0    A  332.0     NaN
1    B  252.0     NaN
2    C    NaN     NaN
3  NaN  167.0     NaN
4  NaN    NaN     NaN
5  NaN    NaN     NaN

In [23]:
data.dropna(how='all',axis=0)

  Name     ID  Adress
0    A  332.0     NaN
1    B  252.0     NaN
2    C    NaN     NaN
3  NaN  167.0     NaN

In [24]:
data.dropna(how='all',axis=1)

  Name     ID
0    A  332.0
1    B  252.0
2    C    NaN
3  NaN  167.0
4  NaN    NaN
5  NaN    NaN

In [25]:
data.dropna(axis=0,subset=['ID'])

  Name     ID  Adress
0    A  332.0     NaN
1    B  252.0     NaN
3  NaN  167.0     NaN

In [26]:
data.dropna(axis=0,subset=['Name'])

  Name     ID  Adress
0    A  332.0     NaN
1    B  252.0     NaN
2    C    NaN     NaN

In [32]:
data.dropna(thresh=1)

  Name     ID  Adress
0    A  332.0     NaN
1    B  252.0     NaN
2    C    NaN     NaN
3  NaN  167.0     NaN

In [34]:
data=pd.DataFrame({"name":['Ani','Anu','Anee'],
                  "id":[332,282,np.nan]})

In [41]:
data=pd.DataFrame({"name":['A','B','C','D'],
                  "score":[4,34,34,344]})

In [46]:
d=np.arange(0,11,1)
d

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [48]:
k=pd.cut(d,[-1,5,10],labels=['low','high'])
k

['low', 'low', 'low', 'low', 'low', ..., 'high', 'high', 'high', 'high', 'high']
Length: 11
Categories (2, object): ['low' < 'high']